thesis/ideas.tex
% Created 2015-04-30 Thu 17:37
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\providecommand{\alert}[1]{\textbf{#1}}

\title{Thesis Ideas}
\author{Lars Johnson}
\date{\today}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.9.3f}}

\begin{document}

\maketitle

\section{Overview}
\label{sec-1}
\subsection{Visualizing ``In the Mind's Eye''}
\label{sec-1-1}
\section{Prior Work}
\label{sec-2}
\section{Imperative Geometry Construction System}
\label{sec-3}
\subsection{Basic Structures}
\label{sec-3-1}
\subsubsection{Points}
\label{sec-3-1-1}

\begin{itemize}
\item Basis of most elements, always named.
\item Only coordinates, primary component that need to be translated
\end{itemize}
\subsubsection{Linear Elements: Segments, Lines, Rays}
\label{sec-3-1-2}

\begin{itemize}
\item Linear
\end{itemize}
\subsubsection{Angles}
\label{sec-3-1-3}

\begin{itemize}
\item Initially three points, now vertext + two direction
\item CCW orientation
\item Methods to determine from elements
\item ``Arms'' of an angle: ``Directions''
\item[Future:]
\begin{itemize}
\item Possibly automatically extract angles from diagrams
        (e.g. from a pile of points and segments)
\end{itemize}
\end{itemize}
\subsubsection{Circles, Arcs}
\label{sec-3-1-4}

\begin{itemize}
\item Currently, very limited support
\item Future: Arcs, Tangents
\end{itemize}
\subsubsection{Math Support (Directions, Vectors)}
\label{sec-3-1-5}

\begin{itemize}
\item Direction: [0, 2pi]. Quasi ``type-checking'', direction
      optimizations
\item Separates from ``angle measures'', for instance.
\item Could generalize/genericize to dx, dy or theta for numerical precision.
\item Various utils, determinants, fix-angle-0-2pi, radians/degrees
\end{itemize}
\subsection{Higher-level structures:}
\label{sec-3-2}
\subsubsection{Polygons:}
\label{sec-3-2-1}

\begin{itemize}
\item Group of points (and derived segments).
\item Dependencies
\item Other Accessors?
\end{itemize}
\subsubsection{Figures:}
\label{sec-3-2-2}

\begin{itemize}
\item Currently just groups of elements, could abstract / extract
      more information.
\end{itemize}
\subsubsection{Adjacency, Graph}
\label{sec-3-2-3}

\begin{itemize}
\item ? Store the adjacencies.
\end{itemize}
\subsection{Construction Operations}
\label{sec-3-3}
\subsubsection{Traditional}
\label{sec-3-3-1}

\begin{itemize}
\item Midpoint, perpendicular line, perp. bisector, angle bisector
\end{itemize}
\subsubsection{Intersections}
\label{sec-3-3-2}

\begin{itemize}
\item Generic intersection, based on line/line and line/circle at
      core + checks that final result is on the elements.
\item Handling multiple intersections
\end{itemize}
\subsubsection{Measurement-based}
\label{sec-3-3-3}

\begin{itemize}
\item ``Ruler/protractor'' not standard geometry tools, but effective
      in practice.
\item Distance, angle measures => creating measured points
\end{itemize}
\subsubsection{Transformations}
\label{sec-3-3-4}

\begin{itemize}
\item Rotate about a point
\item Translate by vector
\end{itemize}
\subsection{Randomness}
\label{sec-3-4}
\subsubsection{Random Choices}
\label{sec-3-4-1}

\begin{itemize}
\item At basis is a ``random range''.
\end{itemize}
\subsubsection{Remembering choices}
\label{sec-3-4-2}

\begin{itemize}
\item Persisting values across random choices, repeated instances / frames.
\end{itemize}
\subsubsection{Backtracking?}
\label{sec-3-4-3}

\begin{itemize}
\item TODO? Continuations
\end{itemize}
\subsubsection{Avoiding Almost-degenerate points}
\label{sec-3-4-4}

\begin{itemize}
\item TODO? Requires backtracking.
\end{itemize}
\subsubsection{Animating}
\label{sec-3-4-5}

\begin{itemize}
\item Animate over a small range within the specified random range
\item Infrastructure for determining frames, sleeping, etc.
\item Constructions can request to animate functions of one arg [0, 1]
\end{itemize}
\subsection{Dependencies}
\label{sec-3-5}
\subsubsection{Implementation}
\label{sec-3-5-1}

\begin{itemize}
\item Eq-properties, etc.
\end{itemize}
\subsubsection{Naming}
\label{sec-3-5-2}

\begin{itemize}
\item Specified by the user upon creation
\item Sometimes derived if unnamed (e.g. segments)
\item[Future]: do
\begin{itemize}
\item $\Box$ more of this?
\end{itemize}
\end{itemize}
\subsubsection{Dependencies}
\label{sec-3-5-3}

\begin{itemize}
\item Unknown dependencies
\item Numbered random dependencies
\end{itemize}
\subsubsection{Forcing higher-level random dependencies}
\label{sec-3-5-4}

\begin{itemize}
\item ``Inverts'' the dependency tree that would otherwise usually go
      down to points. set-dependency! as random-square, e.g.
\end{itemize}
\subsection{Construction Language}
\label{sec-3-6}
\subsubsection{Macros}
\label{sec-3-6-1}
\subsubsection{Multiple Assignment}
\label{sec-3-6-2}
\subsection{Graphics}
\label{sec-3-7}
\subsubsection{XScheme Graphics}
\label{sec-3-7-1}

\begin{itemize}
\item MIT Scheme Graphics system
\item Basic primitives, colors, text, etc.
\item Labels for elements.
\end{itemize}
\subsubsection{Bounds}
\label{sec-3-7-2}

\begin{itemize}
\item Restrict lines/rays to graphics bounds so they can be drawn.
\item[Future]:
\begin{itemize}
\item Logical bounds vs. graphic bounds
\end{itemize}
\end{itemize}
\subsection{Analysis}
\label{sec-3-8}
\subsubsection{What is Interesting}
\label{sec-3-8-1}

\begin{itemize}
\item Concurrent points
\item Equal Angles
\item Supplementary Angles
\item Complementary Angles
\item Perpendicular Elements
\item Equal Segments
\end{itemize}
\subsubsection{Removing obvious properties}
\label{sec-3-8-2}

\begin{itemize}
\item Traverse dependencies (and adjacency?) graphs
\end{itemize}
\subsubsection{Representing discoveries}
\label{sec-3-8-3}

\begin{itemize}
\item TODO
\end{itemize}
\subsubsection{Output to users}
\label{sec-3-8-4}

\begin{itemize}
\item Currently prints dependencies
\end{itemize}
\section{Declarative Geometry Constraint Solver}
\label{sec-4}
\subsection{Mechanical Analogies}
\label{sec-4-1}
\subsubsection{Bars, Joint Linkages}
\label{sec-4-1-1}
\subsubsection{Mechanism}
\label{sec-4-1-2}

\begin{itemize}
\item Analogous to ``figure'' in imperative system.
\end{itemize}
\subsubsection{Propagators}
\label{sec-4-1-3}
\subsection{Partial Information}
\label{sec-4-2}
\subsubsection{Regions}
\label{sec-4-2-1}
\subsubsection{Direction Intervals}
\label{sec-4-2-2}

\begin{itemize}
\item Ranges of intervals
\item Full Circle + Invalid intervals
\item Challenges with intersection, multiple segments.
\end{itemize}
\subsection{Propagator Constraints}
\label{sec-4-3}
\subsubsection{Basic Constraints for Bar, Joint}
\label{sec-4-3-1}
\subsubsection{Higher-level constraints}
\label{sec-4-3-2}
\subsection{Specification Ordering}
\label{sec-4-4}
\subsubsection{Constraints First}
\label{sec-4-4-1}
\section{Learning}
\label{sec-5}

\end{document}
